{"modelTopology": {"training_config": {"metrics": [], "sample_weight_mode": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "amsgrad": false, "decay": 0.0, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}}, "loss": "mse"}, "model_config": {"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_1", "output_layers": [["conv2d_4", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 64, 64, 3], "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d", "class_name": "Conv2D", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 3, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_1", "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "flatten", "class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense", "trainable": true, "units": 128}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 2}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense_3", "trainable": true, "units": 2}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_3", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"axis": -1, "dtype": "float32", "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [], "name": "input_3", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 4], "sparse": false}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}], ["input_3", 0, 0, {}]]], "name": "add", "class_name": "Add", "config": {"dtype": "float32", "name": "add", "trainable": true}}, {"inbound_nodes": [[["add", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense_4", "trainable": true, "units": 128}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense_5", "trainable": true, "units": 65536}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape", "config": {"target_shape": [32, 32, 64], "dtype": "float32", "name": "reshape", "trainable": true}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d_transpose", "class_name": "Conv2DTranspose", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "output_padding": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_transpose", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"padding": "same", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "output_padding": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_transpose_1", "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"padding": "valid", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "output_padding": null, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_transpose_2", "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"padding": "same", "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "filters": 3, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d_4", "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}]}}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}, "weightsManifest": [{"weights": [{"shape": [2, 2, 3, 3], "name": "conv2d/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [2, 2, 3, 64], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_1/bias", "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 64], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_2/bias", "dtype": "float32"}], "paths": ["group3-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 64], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_3/bias", "dtype": "float32"}], "paths": ["group4-shard1of1"]}, {"weights": [{"shape": [2, 2, 64, 3], "name": "conv2d_4/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_4/bias", "dtype": "float32"}], "paths": ["group5-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 64], "name": "conv2d_transpose/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_transpose/bias", "dtype": "float32"}], "paths": ["group6-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 64], "name": "conv2d_transpose_1/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_transpose_1/bias", "dtype": "float32"}], "paths": ["group7-shard1of1"]}, {"weights": [{"shape": [2, 2, 64, 64], "name": "conv2d_transpose_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_transpose_2/bias", "dtype": "float32"}], "paths": ["group8-shard1of1"]}, {"weights": [{"shape": [65536, 128], "name": "dense/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense/bias", "dtype": "float32"}], "paths": ["group9-shard1of9", "group9-shard2of9", "group9-shard3of9", "group9-shard4of9", "group9-shard5of9", "group9-shard6of9", "group9-shard7of9", "group9-shard8of9", "group9-shard9of9"]}, {"weights": [{"shape": [128, 2], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group10-shard1of1"]}, {"weights": [{"shape": [128, 2], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_3/bias", "dtype": "float32"}], "paths": ["group11-shard1of1"]}, {"weights": [{"shape": [4, 128], "name": "dense_4/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_4/bias", "dtype": "float32"}], "paths": ["group12-shard1of1"]}, {"weights": [{"shape": [128, 65536], "name": "dense_5/kernel", "dtype": "float32"}, {"shape": [65536], "name": "dense_5/bias", "dtype": "float32"}], "paths": ["group13-shard1of9", "group13-shard2of9", "group13-shard3of9", "group13-shard4of9", "group13-shard5of9", "group13-shard6of9", "group13-shard7of9", "group13-shard8of9", "group13-shard9of9"]}]}