{"modelTopology": {"training_config": {"metrics": [], "sample_weight_mode": null, "loss_weights": null, "loss": "mse", "optimizer_config": {"config": {"lr": 0.009999999776482582, "decay": 0.0, "nesterov": false, "momentum": 0.0}, "class_name": "SGD"}}, "backend": "tensorflow", "model_config": {"config": {"output_layers": [["add_7", 0, 0]], "name": "model_2", "input_layers": [["input_3", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 64, 64, 3], "sparse": false}, "name": "input_3", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 16, "name": "conv2d_16", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 32, "name": "conv2d_17", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_18", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_8", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_8", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_19", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_9", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_9", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_20", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_20", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "class_name": "Add"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_14", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_14", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [4, 4], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 16, "name": "conv2d_transpose", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_transpose", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [4, 4], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 8, "name": "conv2d_transpose_1", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_transpose_1", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_21", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_10", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_10", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_22", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_12", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_12", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"name": "zero_padding2d_11", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_11", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_26", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_23", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_13", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_13", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["conv2d_23", 0, 0, {}], ["conv2d_21", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_27", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_27", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_15", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_15", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_21", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 4, "name": "conv2d_24", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_16", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_16", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 1, "name": "conv2d_25", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_28", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_28", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_2", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_29", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_29", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_3", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "one_minus_layer", "trainable": true, "dtype": "float32"}, "name": "one_minus_layer", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "oneMinusLayer"}, {"config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["input_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Multiply"}, {"config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["activation_3", 0, 0, {}], ["one_minus_layer", 0, 0, {}]]], "class_name": "Multiply"}, {"config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["multiply", 0, 0, {}], ["multiply_1", 0, 0, {}]]], "class_name": "Add"}]}, "class_name": "Model"}, "keras_version": "2.1.4"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [2, 2, 3, 16], "name": "conv2d_16/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d_16/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [2, 2, 16, 32], "name": "conv2d_17/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_17/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [1, 1, 32, 32], "name": "conv2d_18/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_18/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_19/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_19/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_20/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_20/bias", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [1, 1, 8, 3], "name": "conv2d_21/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_21/bias", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_22/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_22/bias", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_23/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_23/bias", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [1, 1, 3, 4], "name": "conv2d_24/kernel", "dtype": "float32"}, {"shape": [4], "name": "conv2d_24/bias", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [1, 1, 4, 1], "name": "conv2d_25/kernel", "dtype": "float32"}, {"shape": [1], "name": "conv2d_25/bias", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_26/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_26/bias", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_27/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_27/bias", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [1, 1, 3, 3], "name": "conv2d_28/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_28/bias", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [1, 1, 3, 3], "name": "conv2d_29/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_29/bias", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [4, 4, 16, 32], "name": "conv2d_transpose/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d_transpose/bias", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [4, 4, 8, 16], "name": "conv2d_transpose_1/kernel", "dtype": "float32"}, {"shape": [8], "name": "conv2d_transpose_1/bias", "dtype": "float32"}]}]}