{"modelTopology": {"training_config": {"metrics": [], "sample_weight_mode": null, "loss_weights": null, "loss": "mse", "optimizer_config": {"config": {"lr": 0.009999999776482582, "decay": 0.0, "nesterov": false, "momentum": 0.0}, "class_name": "SGD"}}, "backend": "tensorflow", "model_config": {"config": {"output_layers": [["add_11", 0, 0]], "name": "model_3", "input_layers": [["input_4", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_4", "batch_input_shape": [null, 64, 64, 3], "sparse": false}, "name": "input_4", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 16, "name": "conv2d_30", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_30", "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 32, "name": "conv2d_31", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_31", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_32", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_32", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_14", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_14", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_33", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_33", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_15", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_15", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_34", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_34", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["conv2d_34", 0, 0, {}], ["conv2d_32", 0, 0, {}]]], "class_name": "Add"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_17", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_17", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [4, 4], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 16, "name": "conv2d_transpose_2", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_transpose_2", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [4, 4], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "filters": 8, "name": "conv2d_transpose_3", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_transpose_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_35", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_35", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_16", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_16", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_36", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_36", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_18", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_18", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"name": "zero_padding2d_17", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_17", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_40", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_40", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_37", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_37", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_19", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "zero_padding2d_19", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "name": "add_9", "inbound_nodes": [[["conv2d_37", 0, 0, {}], ["conv2d_35", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_41", "trainable": true, "padding": "valid", "bias_constraint": null}, "name": "conv2d_41", "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_18", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_18", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "name": "add_10", "inbound_nodes": [[["conv2d_41", 0, 0, {}], ["conv2d_35", 0, 0, {}]]], "class_name": "Add"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 4, "name": "conv2d_38", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_38", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"alpha": 0.0, "name": "leaky_re_lu_19", "trainable": true, "dtype": "float32"}, "name": "leaky_re_lu_19", "inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 1, "name": "conv2d_39", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_39", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_42", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_42", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_4", "inbound_nodes": [[["conv2d_39", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "name": "conv2d_43", "trainable": true, "padding": "same", "bias_constraint": null}, "name": "conv2d_43", "inbound_nodes": [[["conv2d_42", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_5", "inbound_nodes": [[["conv2d_43", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "one_minus_layer_1", "trainable": true, "dtype": "float32"}, "name": "one_minus_layer_1", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "oneMinusLayer"}, {"config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "name": "multiply_2", "inbound_nodes": [[["input_4", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Multiply"}, {"config": {"name": "multiply_3", "trainable": true, "dtype": "float32"}, "name": "multiply_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["one_minus_layer_1", 0, 0, {}]]], "class_name": "Multiply"}, {"config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "name": "add_11", "inbound_nodes": [[["multiply_2", 0, 0, {}], ["multiply_3", 0, 0, {}]]], "class_name": "Add"}]}, "class_name": "Model"}, "keras_version": "2.1.4"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [2, 2, 3, 16], "name": "conv2d_30/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d_30/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [2, 2, 16, 32], "name": "conv2d_31/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_31/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [1, 1, 32, 32], "name": "conv2d_32/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_32/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_33/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_33/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_34/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_34/bias", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [1, 1, 8, 3], "name": "conv2d_35/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_35/bias", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_36/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_36/bias", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_37/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_37/bias", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [1, 1, 3, 4], "name": "conv2d_38/kernel", "dtype": "float32"}, {"shape": [4], "name": "conv2d_38/bias", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [1, 1, 4, 1], "name": "conv2d_39/kernel", "dtype": "float32"}, {"shape": [1], "name": "conv2d_39/bias", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_40/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_40/bias", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [3, 3, 3, 3], "name": "conv2d_41/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_41/bias", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [1, 1, 3, 3], "name": "conv2d_42/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_42/bias", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [1, 1, 3, 3], "name": "conv2d_43/kernel", "dtype": "float32"}, {"shape": [3], "name": "conv2d_43/bias", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [4, 4, 16, 32], "name": "conv2d_transpose_2/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d_transpose_2/bias", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [4, 4, 8, 16], "name": "conv2d_transpose_3/kernel", "dtype": "float32"}, {"shape": [8], "name": "conv2d_transpose_3/bias", "dtype": "float32"}]}]}